# Pandas
Pandas documentation: http://pandas.pydata.org/pandas-docs/stable/index.html

Pandas는 아래와 같은 데이터를 다루기에 적합한 패키지입니다.
- Tabular data with heterogeneously-typed columns, as in an SQL table or Excel spreadsheet
- Ordered and unordered (not necessarily fixed-frequency) time series data.
- Arbitrary matrix data (homogeneously typed or heterogeneous) with row and column labels
- Any other form of observational / statistical data sets. The data actually need not be labeled at all to be placed into a pandas data structure

Pandas만의 특이한 데이터 구조
- **Series** (1-dimensional)
- **DataFrame** (2-dimensiona): R의 data frame과 거의 흡사하며 이를 다루는 함수 또한 R과 매우 유사함

## 1. Series
- 1차원 배열
- 자동으로 성분들이 0부터 시작하는 정수로 인덱싱됨. 이는 list와 tuple과 유사함
- 인덱스를 자신이 원하는 형태로 바꿀 수 있다는 점에서 dictionary와 유사함

In [1]:
import numpy as np
import pandas as pd

In [3]:
a = [1,2,3,4,5]
a_array = np.array(a)
a_series = pd.Series(a)

print(a)
print(a_array)
print(a_series)

[1, 2, 3, 4, 5]
[1 2 3 4 5]
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
a = pd.Series([1,2,3,4,5])
print(a)
# 1열은 index, 2열은 Series의 성분이 출력됨

b = pd.Series([1,3,5,np.nan,6,8]) # NaN: Not a Number
print(b)
# Series에는 type이 다른 성분을 넣을 수 있습니다.

0    1
1    2
2    3
3    4
4    5
dtype: int64
0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
a = pd.Series([10000, 20000, 30000, 40000, 50000])
# print(a)
# print(a[0])
# print(a[2])

# Series의 인덱싱을 날짜로 변경
dates = pd.date_range('20160801', periods = 5)
a = pd.Series([10000, 20000, 30000, 40000, 50000], index = dates)
print(a)
print(a['2016-08-01'])
print(a['2016-08-03'])
print(a[0])
print(a[2])

2016-08-01    10000
2016-08-02    20000
2016-08-03    30000
2016-08-04    40000
2016-08-05    50000
Freq: D, dtype: int64
10000
30000
10000
30000

In [6]:
# WikiDocs [파이썬을 이용한 시스템 트레이딩(기초편)] 에서 가져온 예제
mine = pd.Series([10,20,30], index=['naver','skt','kt'])
wife = pd.Series([10,30,20], index=['kt','naver','skt'])

print("내 주식")
print(mine)
print("아내 주식")
print(wife)

family = mine + wife
print(family)

내 주식
naver    10
skt      20
kt       30
dtype: int64
아내 주식
kt       10
naver    30
skt      20
dtype: int64
kt       40
naver    40
skt      40
dtype: int64

## 2. DataFrame
- 2차원 형태의 자료구조
- R의 dataframe과 거의 유사

In [7]:
# WikiDocs [파이썬을 이용한 시스템 트레이딩(기초편)] 에서 가져온 예제
raw_data = {'col0': [1,2,3,4],
           'col1': [10,20,30,40],
           'col2': [100,200,300,400]}
data = pd.DataFrame(raw_data)
print(data)
print(data['col1'])

print(type(raw_data)) # 위에서 정의한 raw_data는 dictionary임을 확인
print(type(data)) # DataFrame이라는 type임을 확인
print(type(data['col1']))

   col0  col1  col2
0     1    10   100
1     2    20   200
2     3    30   300
3     4    40   400
0    10
1    20
2    30
3    40
Name: col1, dtype: int64
<class 'dict'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [8]:
df = pd.DataFrame({ 'A' : 1., 
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

print(df)
print(df.dtypes)
print(df.head(2))
print(df.tail(2))

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo
A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object
     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
     A          B    C  D      E    F
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
data = {'temperature': [29, 34, 36, 32, 30],
       'humidity': ['mid', 'high', 'high', 'mid', 'low'],
       'weather': ['cloudy', 'sunny', 'rainy', 'cloudy', 'sunny']}
a = pd.DataFrame(data)
print(a)

   temperature humidity weather
0           29      mid  cloudy
1           34     high   sunny
2           36     high   rainy
3           32      mid  cloudy
4           30      low   sunny

In [10]:
a

   temperature humidity weather
0           29      mid  cloudy
1           34     high   sunny
2           36     high   rainy
3           32      mid  cloudy
4           30      low   sunny

In [11]:
# index에 날짜를 넣기
date = ['2016-08-01', '2016-08-02', '2016-08-03', '2016-08-04', '2016-08-05']
# 변수의 순서를 정해주기
features = ['temperature', 'humidity', 'weather']
b = pd.DataFrame(data, columns = features, index = date)
print(b)

            temperature humidity weather
2016-08-01           29      mid  cloudy
2016-08-02           34     high   sunny
2016-08-03           36     high   rainy
2016-08-04           32      mid  cloudy
2016-08-05           30      low   sunny

In [12]:
b

            temperature humidity weather
2016-08-01           29      mid  cloudy
2016-08-02           34     high   sunny
2016-08-03           36     high   rainy
2016-08-04           32      mid  cloudy
2016-08-05           30      low   sunny

In [13]:
# DataFrame에서 특정 열을 가져오는 방법 1
b.temperature

2016-08-01    29
2016-08-02    34
2016-08-03    36
2016-08-04    32
2016-08-05    30
Name: temperature, dtype: int64

In [14]:
# DataFrame에서 특정 열을 가져오는 방법 2
b['temperature']

2016-08-01    29
2016-08-02    34
2016-08-03    36
2016-08-04    32
2016-08-05    30
Name: temperature, dtype: int64

In [15]:
# 특정 인덱스의 행을 가져오는 방법
b.loc['2016-08-01']

temperature        29
humidity          mid
weather        cloudy
Name: 2016-08-01, dtype: object

In [16]:
# DataFrame에 'windy'라는 새로운 열을 추가
windy = ['yes', 'no', 'yes', 'yes', 'no']
b['windy'] = windy
print(b)

            temperature humidity weather windy
2016-08-01           29      mid  cloudy   yes
2016-08-02           34     high   sunny    no
2016-08-03           36     high   rainy   yes
2016-08-04           32      mid  cloudy   yes
2016-08-05           30      low   sunny    no

In [17]:
# temperature가 30도 이하이고, weather가 sunny이면
# 나가서 논다는 데이터를 입력해봅시다.
b['play'] = (b['temperature'] <= 30) & (b['weather'] == 'sunny')
print(b)

            temperature humidity weather windy   play
2016-08-01           29      mid  cloudy   yes  False
2016-08-02           34     high   sunny    no  False
2016-08-03           36     high   rainy   yes  False
2016-08-04           32      mid  cloudy   yes  False
2016-08-05           30      low   sunny    no   True

In [18]:
# Given the DataFrame
b

            temperature humidity weather windy   play
2016-08-01           29      mid  cloudy   yes  False
2016-08-02           34     high   sunny    no  False
2016-08-03           36     high   rainy   yes  False
2016-08-04           32      mid  cloudy   yes  False
2016-08-05           30      low   sunny    no   True

In [19]:
# Transpose the DataFrame
b.T

            2016-08-01 2016-08-02 2016-08-03 2016-08-04 2016-08-05
temperature         29         34         36         32         30
humidity           mid       high       high        mid        low
weather         cloudy      sunny      rainy     cloudy      sunny
windy              yes         no        yes        yes         no
play             False      False      False      False       True

In [20]:
# delete the column 'humidity'
del b['humidity']

In [21]:
b

            temperature weather windy   play
2016-08-01           29  cloudy   yes  False
2016-08-02           34   sunny    no  False
2016-08-03           36   rainy   yes  False
2016-08-04           32  cloudy   yes  False
2016-08-05           30   sunny    no   True

## 3. Data join
There are actually four types of joins supported by the Pandas `merge` function. Here's how they are described by the documentation:

- **inner:** use intersection of keys from both frames (SQL: inner join)
- **outer:** use union of keys from both frames (SQL: full outer join)
- **left:** use only keys from left frame (SQL: left outer join)
- **right:** use only keys from right frame (SQL: right outer join)

The default is the "inner join", which was used when creating the movie_ratings DataFrame.

It's easiest to understand the different types by looking at some simple examples:

In [22]:
A = pd.DataFrame({'color': ['green', 'yellow', 'red'], 'num':[1, 2, 3]})
A

    color  num
0   green    1
1  yellow    2
2     red    3

In [23]:
B = pd.DataFrame({'color': ['green', 'yellow', 'pink'], 'size':['S', 'M', 'L']})
B

    color size
0   green    S
1  yellow    M
2    pink    L

### Inner join
A와 B에 동시에 등장하는 포인트들을 조인

In [24]:
pd.merge(left=A, right=B, how='inner')

    color  num size
0   green    1    S
1  yellow    2    M

In [25]:
pd.merge(A, B, how='inner')

    color  num size
0   green    1    S
1  yellow    2    M

### Outer join
A 또는 B에 모두 등장하는 포인트들을 조인

In [26]:
pd.merge(A, B, how='outer')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2     red  3.0  NaN
3    pink  NaN    L

### Left join
A에 포함된 포인트들만 조인

In [27]:
pd.merge(A, B, how='left')

    color  num size
0   green    1    S
1  yellow    2    M
2     red    3  NaN

### Right join
B에 포함된 포인트들만 조인

In [28]:
pd.merge(A, B, how='right')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2    pink  NaN    L

### Example
(From Kevin Markham's data science course)

Using the [MovieLens 100k data](http://grouplens.org/datasets/movielens/), let's create two DataFrames:

- **movies**: shows information about movies, namely a unique **movie_id** and its **title**
- **ratings**: shows the **rating** that a particular **user_id** gave to a particular **movie_id** at a particular **timestamp**

#### Movies

In [29]:
movie_file = 'data/movie.txt'
movie_cols = ['movie_id', 'title']
movies = pd.read_table(movie_file, sep='|', header=None, names=movie_cols, usecols=[0, 1])
movies.head()

/Users/kth/miniconda3/envs/ml/lib/python3.6/site-packages/ipykernel_launcher.py:3: FutureWarning: read_table is deprecated, use read_csv instead.
  This is separate from the ipykernel package so we can avoid doing imports until

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

#### Ratings

In [30]:
rating_file = 'data/movie_rating.txt'
rating_cols = ['user_id', 'movie_id', 'rating', 'timestamp']
ratings = pd.read_table(rating_file, sep='\t', header=None, names=rating_cols)
ratings.head()

/Users/kth/miniconda3/envs/ml/lib/python3.6/site-packages/ipykernel_launcher.py:3: FutureWarning: read_table is deprecated, use read_csv instead.
  This is separate from the ipykernel package so we can avoid doing imports until

  user_id  movie_id  rating    timestamp
0     196       242       3  881250949.0
1     186       302       3  891717742.0
2      22       377       1  878887116.0
3     244        51       2  880606923.0
4     166       346       1  886397596.0

Let's pretend that you want to examine the ratings DataFrame, but you want to know the **title** of each movie rather than its **movie_id**. The best way to accomplish this objective is by "joining" (or "merging") the DataFrames using the Pandas `merge` function:

In [31]:
movie_ratings = pd.merge(movies, ratings)
movie_ratings.head()

   movie_id             title user_id  rating    timestamp
0         1  Toy Story (1995)     308       4  887736532.0
1         1  Toy Story (1995)     287       5  875334088.0
2         1  Toy Story (1995)     148       4  877019411.0
3         1  Toy Story (1995)     280       4  891700426.0
4         1  Toy Story (1995)      66       3  883601324.0

Here's what just happened:

- Pandas noticed that movies and ratings had one column in common, namely **movie_id**. This is the "key" on which the DataFrames will be joined.
- The first **movie_id** in movies is 1. Thus, Pandas looked through every row in the ratings DataFrame, searching for a movie_id of 1. Every time it found such a row, it recorded the **user_id**, **rating**, and **timestamp** listed in that row. In this case, it found 452 matching rows.
- The second **movie_id** in movies is 2. Again, Pandas did a search of ratings and found 131 matching rows.
- This process was repeated for all of the remaining rows in movies.

At the end of the process, the movie_ratings DataFrame is created, which contains the two columns from movies (**movie_id** and **title**) and the three other colums from ratings (**user_id**, **rating**, and **timestamp**).

- **movie_id** 1 and its **title** are listed 452 times, next to the **user_id**, **rating**, and **timestamp** for each of the 452 matching ratings.
- **movie_id** 2 and its **title** are listed 131 times, next to the **user_id**, **rating**, and **timestamp** for each of the 131 matching ratings.
- And so on, for every movie in the dataset.

In [ ]:
print(movies.shape)
print(ratings.shape)
print(movie_ratings.shape)

Notice the shapes of the three DataFrames:

- There are 1682 rows in the movies DataFrame.
- There are 100000 rows in the ratings DataFrame.
- The `merge` function resulted in a movie_ratings DataFrame with 100000 rows, because every row from ratings matched a row from movies.
- The movie_ratings DataFrame has 5 columns, namely the 2 columns from movies, plus the 4 columns from ratings, minus the 1 column in common.

By default, the `merge` function joins the DataFrames using all column names that are in common (**movie_id**, in this case). The [documentation](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html) explains how you can override this behavior.